In [1]:
import pandas as pd
import sqlite3
import sql

sql.style = 'plain'

%load_ext sql
connection=sqlite3.connect("leetcode_database.db")
print("Successfully connected to SQL database")


# Connect to SQLite
%sql sqlite:///leetcode_database.db
print("success")

Successfully connected to SQL database
success

In [3]:
%%sql
-- Drop the table if it already exists
DROP TABLE IF EXISTS Customer;

-- Create the Customer table
CREATE TABLE Customer (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    referee_id INT
);

-- Insert data into Customer table
INSERT INTO Customer (id, name, referee_id) VALUES
(1, 'Will', NULL),
(2, 'Jane', NULL),
(3, 'Alex', 2),
(4, 'Bill', NULL),
(5, 'Zack', 1),
(6, 'Mark', 2);

 * sqlite:///leetcode_database.db
Done.
Done.
6 rows affected.

[]

In [4]:
%%sql
SELECT * FROM Customer

 * sqlite:///leetcode_database.db
Done.

[(1, 'Will', None),
 (2, 'Jane', None),
 (3, 'Alex', 2),
 (4, 'Bill', None),
 (5, 'Zack', 1),
 (6, 'Mark', 2)]

##### Problem Statement - Find the names of the customer that are not referred by the customer with id = 2.

* Psuedo Code
  1. Find those customer who are not referred by id 2

In [11]:
%%sql
SELECT name
FROM Customer
WHERE referee_id !=2 OR referee_id IS NULL

 * sqlite:///leetcode_database.db
Done.

[('Will',), ('Jane',), ('Bill',), ('Zack',)]

* Few Learnings : 
* Only Zack is not referred by 2, rest all are null values
* So, we can use != not equal to function of sql to find out zack
* But we, also have to handle and consider customers with null referees/values
* And for that, we have clauses like
    * IS NULL
    * NOT NULL
* WE used 'OR' here and not 'AND', we need customers who are not referred by
* id 2 OR have null referees, but should not be refereed by id

In [14]:
%%sql
SELECT * FROM Customer
WHERE referee_id IS NULL                      -- IS NULL - rows with NULL values

 * sqlite:///leetcode_database.db
Done.

[(1, 'Will', None), (2, 'Jane', None), (4, 'Bill', None)]

In [16]:
%%sql
SELECT * FROM Customer
WHERE referee_id NOT NULL                    -- NOT NULL - rows with no NULL values

 * sqlite:///leetcode_database.db
Done.

[(3, 'Alex', 2), (5, 'Zack', 1), (6, 'Mark', 2)]

* IS NULL and NOT NULL only true for NULL
* if column has = 'NA' - , true when considered as string
* column = 'NONE' - consider that as string
##### Most optimised way is
  WHERE column IN ('NA', 'NONE', 'N/A', NULL) âœ… Match any of these literal strings

#### OR | AND | BETWEEN

* AND - Combine Multiple True Conditions, returns only those rows that satisfies all the conditions
* OR - Combine Alternatives - Returns those rows that satisfies atleast one condition
* BETWEEN - FOR KEEP A RANGE - WHERE column BETWEEN value1 AND value2;

##### Common Mistake - USE of OR + AND

In [18]:
%%sql
SELECT * FROM Customer
WHERE (name = 'Alex' OR 'Mark') AND referee_id=2

 * sqlite:///leetcode_database.db
Done.

[(3, 'Alex', 2)]